In [39]:
import pandas as pd 
import numpy as np

In [40]:
data = {
    'name':['ali','maryam','taha','ali','taha','maryam','taha'],
    'saler': [10,12,20,5,8,12,4],
    'amount':[100,250,130,350,230,533,273]
}

In [41]:
df  = pd.DataFrame(data)
df

     name  saler  amount
0     ali     10     100
1  maryam     12     250
2    taha     20     130
3     ali      5     350
4    taha      8     230
5  maryam     12     533
6    taha      4     273

In [ ]:
pd.pivot_table(
    df,
    values=["saler", "amount"],
    index=["name"],
    aggfunc={"amount": np.mean, "saler": np.sum},  # darhalat adi mean
)

C:\Users\Taha\AppData\Local\Temp\ipykernel_7608\1833659196.py:1: FutureWarning: The provided callable <function mean at 0x000002D9C17316C0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(
C:\Users\Taha\AppData\Local\Temp\ipykernel_7608\1833659196.py:1: FutureWarning: The provided callable <function sum at 0x000002D9C17302C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pd.pivot_table(

        amount  saler
name
ali      225.0     15
maryam   391.5     24
taha     211.0     32

---

In [43]:
! pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\taha\desktop\python_p\ai\learning_venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\taha\desktop\python_p\ai\learning_venv\lib\site-packages (from openpyxl) (2.0.0)

In [44]:
df  = pd.read_excel('sales-funnel.xlsx')
df

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented

In [52]:
table = pd.pivot_table(df,index=['Manager','Rep'],values=['Price'],aggfunc=[np.sum,len])
table

C:\Users\Taha\AppData\Local\Temp\ipykernel_7608\2181757617.py:1: FutureWarning: The provided callable <function sum at 0x000002D9C17302C0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  table = pd.pivot_table(df,index=['Manager','Rep'],values=['Price'],aggfunc=[np.sum,len])

                                sum   len
                              Price Price
Manager       Rep
Debra Henley  Craig Booker    80000     4
              Daniel Hilton  115000     3
              John Smith      40000     2
Fred Anderson Cedric Moss    110000     4
              Wendy Yule     177000     4

In [53]:
table.to_excel('out.xlsx')